{
  "changelog": [
    {
      "version": "0.0.3",
      "novo": [
        "Suporte para transações parceladas no módulo financeiro",
        "Botão para alternar entre temas claro e escuro, facilitando a personalização da aparência",
        "Campo de horário adicionado ao formulário de transações para registrar data e hora com precisão"
      ],
      "alteracoes": [
        "Melhorias no visual e estilo do aplicativo, incluindo bordas, sombras, animações e layout mais moderno",
        "Atualização do idioma do site para português do Brasil para melhor experiência local",
        "Lista de transações agora exibe as 5 mais recentes com data e hora detalhadas",
        "Ajustes na formatação de valores monetários para exibição consistente em todo o app",
        "Correção no registro de data e hora para mostrar o horário local correto sem erros"
      ],
      "removidos": [
        "Definições duplicadas da formatação de valores monetários em componentes específicos"
      ]
    },
    {
      "version": "0.0.2",
      "novo": [
        "Adicionada a entidade 'Local' com operações básicas e integração na interface e API.",
        "Implementado upload de imagens com autenticação e suporte na interface.",
        "Adicionado recurso para anexar comprovantes e selecionar local nas transações.",
        "Criado layout com abas para facilitar a gestão financeira.",
        "Adicionados componentes para gerenciar categorias financeiras e formas de pagamento.",
        "Incluídas novas guias reutilizáveis para navegação consistente.",
        "Disponibilizadas instruções claras para configuração de variáveis de ambiente."
      ],
      "alteracoes": [
        "Melhorada a organização dos componentes financeiros, removendo elementos desnecessários.",
        "Atualizada a configuração para usar variáveis de ambiente para maior flexibilidade.",
        "Aprimorada a aparência da interface com estilos padronizados."
      ],
      "removidos": []
    },
    {
      "version": "0.0.1",
      "novo": [
        "Estrutura inicial do projeto com suporte para autenticação e gerenciamento de usuários.",
        "Login seguro com integração para uso da conta Discord.",
        "Interface organizada para navegação e acesso às funcionalidades do app.",
        "Estilo visual moderno e responsivo para melhor experiência do usuário.",
        "Configuração pronta para uso local do banco de dados para acesso rápido e confiável."
      ],
      "alteracoes": [
        "Documentação inicial para facilitar o entendimento e uso do projeto.",
        "Configurações para garantir que arquivos sensíveis e desnecessários não sejam compartilhados.",
        "Ajustes para melhorar a estabilidade e desempenho da aplicação."
      ],
      "removidos": []
    }
  ]
}